In [1]:
import numpy as np
import pandas as pd
import yfinance as yf
from math import *

[*********************100%***********************]  1 of 1 completed

            samsung
Date
2019-01-02  38750.0
2019-01-03  37600.0
2019-01-04  37450.0
2019-01-07  38750.0
2019-01-08  38100.0

In [2]:
#MACD 구하기
stock = input("Enter firm name: ")
code = input("Enter stock name: ")
data = pd.DataFrame()
data[stock]=yf.download(code, "2019-01-01","2019-12-27")["Close"]
data.head()

#stock = "samsung"
#code="005930.KS"

Enter firm name: samsung
Enter stock name: 005930.KS
[*********************100%***********************]  1 of 1 completed

            samsung
Date
2019-01-02  38750.0
2019-01-03  37600.0
2019-01-04  37450.0
2019-01-07  38750.0
2019-01-08  38100.0

In [3]:
data["MA_10"]=data[stock].rolling(10).mean()
data["MA_30"]=data[stock].rolling(30).mean()
data["macd"]=data["MA_10"]-data["MA_30"]
data["signal"]=data["macd"].rolling(10).mean()
data.dropna(inplace=True)

In [4]:
data

            samsung    MA_10         MA_30         macd       signal
Date
2019-02-28  45100.0  46515.0  45061.666667  1453.333333  2347.833333
2019-03-04  44850.0  46395.0  45186.666667  1208.333333  2139.500000
2019-03-05  44250.0  46200.0  45280.000000   920.000000  1929.166667
2019-03-06  44000.0  46005.0  45348.333333   656.666667  1722.333333
2019-03-07  44450.0  45760.0  45420.000000   340.000000  1509.833333
...             ...      ...           ...          ...          ...
2019-12-19  56000.0  53670.0  52345.000000  1325.000000  -350.666667
2019-12-20  56000.0  54230.0  52448.333333  1781.666667   -84.166667
2019-12-23  55500.0  54660.0  52561.666667  2098.333333   221.000000
2019-12-24  55000.0  55010.0  52675.000000  2335.000000   553.500000
2019-12-26  55400.0  55360.0  52768.333333  2591.666667   917.333333

[205 rows x 5 columns]

In [5]:
data[["macd","signal"]].plot(title="MACD and  signal of " + stock ,legend=True)

In [7]:
import pandas as pd
import yfinance as yf
from math import *

In [8]:
df=pd.DataFrame()
stock="SamSung"
code = "005930.KS"
df[stock]=yf.download(code,"2019-01-01","2019-12-27")['Close']
df['change']=df[stock].diff(1)
df.head()

[*********************100%***********************]  1 of 1 completed

            SamSung  change
Date
2019-01-02  38750.0     NaN
2019-01-03  37600.0 -1150.0
2019-01-04  37450.0  -150.0
2019-01-07  38750.0  1300.0
2019-01-08  38100.0  -650.0

In [10]:
df['U']=df['change'].apply(lambda x: x if x>=0 else 0)
df['D']=df['change'].apply(lambda x: abs(x)if x<0 else 0)

In [11]:
df.head()

            SamSung  change       U       D
Date
2019-01-02  38750.0     NaN     0.0     0.0
2019-01-03  37600.0 -1150.0     0.0  1150.0
2019-01-04  37450.0  -150.0     0.0   150.0
2019-01-07  38750.0  1300.0  1300.0     0.0
2019-01-08  38100.0  -650.0     0.0   650.0

In [29]:
f=lambda x : x if x>=0 else 0
numbers = [1.5,-0.5,2.2,-1.9]
for i in range(len(numbers)): # range(4) i=0
    print("i는 "+ str(i)) # i=0
    print("numbers[i]는" + str(numbers[i])) #numbers[i]
    pos_x=f(numbers[i])
    print("pos_x는" + str(pos_x))
    numbers[i] = pos_x

i는 0
numbers[i]는1.5
pos_x는1.5
i는 1
numbers[i]는-0.5
pos_x는0
i는 2
numbers[i]는2.2
pos_x는2.2
i는 3
numbers[i]는-1.9
pos_x는0

In [22]:
print(numbers)

[1.5, 0, 2.2, 0]